README.org
#+AUTHOR: Anthony Kalaitzis
#+EMAIL: anthony.kalaitzis@gmail.com
#+TITLE: numFort

* Description
numFort is a numerical library for FORTRAN that includes quadpack, lapack and PLplot source code. It enables the use of handy mathematical macros such as linspace. I have wasted so much of my life on this nonsense. 

* Installation - Linux/Unix
** ifort
- Before using numFort, make sure to download the ifort compiler and the necessary math kernel libraries for the use of LAPACK. These may be downloaded from the following link (free for students) [[https://software.intel.com/en-us/qualify-for-free-software/student][Parallel studio XE]], click the C++ link unless on mac
- Simply download the custom install, extract to a location and run under sudo privileges like so
#+BEGIN_SRC shell
  sudo ./install.sh
#+END_SRC
- Make sure to check the math kernel for install
- After installation you may need to export the path to the *ifort* compiler. Add code similar to below in your ~/.bashrc. Your exact path for the above libraries might be different (probably just different numbers for 2018.3.222)
#+BEGIN_SRC shell
  source /opt/intel/bin/compilervars.sh intel64
  export LD_LIBRARY_PATH=$LD_LIBRARY_PATH:/opt/intel/compilers_and_libraries_2018.3.222/linux/mkl/lib/intel64_lin/
  export LD_LIBRARY_PATH=$LD_LIBRARY_PATH:/opt/intel/compilers_and_libraries_2018.3.222/linux/compiler/lib/intel64_lin/
#+END_SRC
- Close and open the terminal to refresh
- Check that it's working by typing
#+BEGIN_SRC shell
  ifort --version
#+END_SRC
- Your ifort version should display
** Cmake
- Download Cmake source code for linux from the following link [[https://cmake.org/download/][CMAKE]]
- Extract the Cmake folder and then open a terminal and move inside
- Type the following commands to install Cmake
#+BEGIN_SRC shell
  ./bootstrap
  sudo make
  sudo make install
#+END_SRC
- Check the installation was successful by opening and closing the terminal, and then typing
#+BEGIN_SRC shell
  cmake --version
#+END_SRC
- This should print a value for your working version of CMAKE. You may have to close and open the terminal to refresh
** PLplot
- Open up a terminal in your home directory. For this example we will install in a folder called ~/bin (/home/user/bin). The following commands downloads the necessary code
#+BEGIN_SRC shell
  mkdir bin
  cd bin
  git clone git://git.code.sf.net/p/plplot/plplot plplot.git
#+END_SRC
- This will download the source code and put it into a folder. Ours will be called PLplotSrc, you may rename yours to this if you wish
- Before continuing we will need to add some path variables in our ~/.bashrc, open ~/.bashrc and write the following. This will tell PLplot to use the ifort compiler (This should be the path to the ifort compiler i.e. where ever you installed it)
#+BEGIN_SRC shell
  export FC=/opt/intel/bin/ifort
#+END_SRC
- Back inside our ~/bin folder with our PLplotSrc sub directory, make the following directories 
#+BEGIN_SRC shell
  mkdir buildDir
  mkdir installDir
  cd buildDir
#+END_SRC
- Just in case, copy the file CMakeLists.txt into your buildDir directory which should be located in PLplotSrc
- We are now going to run the CMAKE command which has the following syntax 
- *MAKE SURE* you run this command whilst in the buildDir and *NOT* PLplotSrc or installDir
#+BEGIN_SRC shell
  cmake -DCMAKE_INSTALL_PREFIX=/path/to/installDir /path/to/PLplotSrc
#+END_SRC
- After the command finishes run the following
#+BEGIN_SRC shell
  make 
  sudo make install
#+END_SRC
- This should take a bit but whens its done you're almost finished!
- This should have filled your installDir with lovely source code. Now simply add the following to your ~/.bashrc (Double check the final files names as they may change with versions of PLplot
#+BEGIN_SRC shell
  export PKG_CONFIG_PATH=$PKG_CONFIG_PATH:~/bin/installDir/lib/pkgconfig/
  export LD_LIBRARY_PATH=$LD_LIBRARY_PATH:~/bin/installDir/lib/
  export LD_LIBRARY_PATH=$LD_LIBRARY_PATH:~/bin/buildDir/bindings/fortran/
#+END_SRC
- Open and close the terminal, that should be everything

