README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-13 Mon 00:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>numFort</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Anthony Kalaitzis" />
</head>
<body>
<div id="content">
<h1 class="title">numFort</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga2c6e92">1. Description</a></li>
<li><a href="#orgb18c79a">2. Installation - Linux/Unix</a>
<ul>
<li><a href="#org1a248a9">2.1. ifort</a></li>
<li><a href="#orgd673d44">2.2. Cmake</a></li>
<li><a href="#orgb8797b7">2.3. PLplot</a></li>
<li><a href="#org6b42087">2.4. NumFort</a></li>
</ul>
</li>
<li><a href="#org97c72eb">3. Documentation</a>
<ul>
<li><a href="#orgdb119c0">3.1. Kinds</a></li>
<li><a href="#org55540e7">3.2. NumFort</a>
<ul>
<li><a href="#org4f359b2">3.2.1. Factorial</a></li>
<li><a href="#orgb15ff21">3.2.2. Meshgrid</a></li>
<li><a href="#org96b0d9f">3.2.3. Splinefit</a></li>
<li><a href="#org3ef7f96">3.2.4. PolyFit</a></li>
<li><a href="#orgb507e27">3.2.5. rk4</a></li>
<li><a href="#org87aba27">3.2.6. GuessZero</a></li>
<li><a href="#orgf025a38">3.2.7. Newton1D</a></li>
<li><a href="#org6326a36">3.2.8. Linspace</a></li>
<li><a href="#orgccf858f">3.2.9. Deriv</a></li>
<li><a href="#org01ade21">3.2.10. integral</a></li>
</ul>
</li>
<li><a href="#orgf4e99d2">3.3. PLplot</a>
<ul>
<li><a href="#orga66e583">3.3.1. plot</a></li>
<li><a href="#org1d29dfb">3.3.2. scatterplot</a></li>
<li><a href="#org947f68d">3.3.3. surf</a></li>
<li><a href="#org43d4a2b">3.3.4. scatter3D</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga2c6e92" class="outline-2">
<h2 id="orga2c6e92"><span class="section-number-2">1</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
numFort is a numerical library for FORTRAN that includes quadpack, lapack and PLplot source code. It enables the use of handy mathematical macros such as linspace. I have wasted so much of my life on this nonsense. 
</p>
</div>
</div>

<div id="outline-container-orgb18c79a" class="outline-2">
<h2 id="orgb18c79a"><span class="section-number-2">2</span> Installation - Linux/Unix</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1a248a9" class="outline-3">
<h3 id="org1a248a9"><span class="section-number-3">2.1</span> ifort</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Before using numFort, make sure to download the ifort compiler and the necessary math kernel libraries for the use of LAPACK. These may be downloaded from the following link (free for students) <a href="https://software.intel.com/en-us/qualify-for-free-software/student">Parallel studio XE</a>, click the C++ link unless on mac</li>
<li>Simply download the custom install, extract to a location and run under sudo privileges like so</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">sudo ./install.sh
</pre>
</div>
<ul class="org-ul">
<li>Make sure to check the math kernel for install</li>
<li>After installation you may need to export the path to the <b>ifort</b> compiler. Add code similar to below in your ~/.bashrc. Your exact path for the above libraries might be different (probably just different numbers for 2018.3.222)</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #87ceeb;">source</span> /opt/intel/bin/compilervars.sh intel64
<span style="color: #87ceeb;">export</span> <span style="color: #ffc125;">LD_LIBRARY_PATH</span>=$<span style="color: #ffc125;">LD_LIBRARY_PATH</span>:/opt/intel/compilers_and_libraries_2018.3.222/linux/mkl/lib/intel64_lin/
<span style="color: #87ceeb;">export</span> <span style="color: #ffc125;">LD_LIBRARY_PATH</span>=$<span style="color: #ffc125;">LD_LIBRARY_PATH</span>:/opt/intel/compilers_and_libraries_2018.3.222/linux/compiler/lib/intel64_lin/
</pre>
</div>
<ul class="org-ul">
<li>Close and open the terminal to refresh</li>
<li>Check that it&rsquo;s working by typing</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">ifort --version
</pre>
</div>
<ul class="org-ul">
<li>Your ifort version should display</li>
</ul>
</div>
</div>
<div id="outline-container-orgd673d44" class="outline-3">
<h3 id="orgd673d44"><span class="section-number-3">2.2</span> Cmake</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Download Cmake source code for linux from the following link <a href="https://cmake.org/download/">CMAKE</a></li>
<li>Extract the Cmake folder and then open a terminal and move inside</li>
<li>Type the following commands to install Cmake</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">./bootstrap
sudo make
sudo make install
</pre>
</div>
<ul class="org-ul">
<li>Check the installation was successful by opening and closing the terminal, and then typing</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">cmake --version
</pre>
</div>
<ul class="org-ul">
<li>This should print a value for your working version of CMAKE. You may have to close and open the terminal to refresh</li>
</ul>
</div>
</div>
<div id="outline-container-orgb8797b7" class="outline-3">
<h3 id="orgb8797b7"><span class="section-number-3">2.3</span> PLplot</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Open up a terminal in your home directory. For this example we will install in a folder called ~/bin (/home/user/bin). The following commands downloads the necessary code</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">mkdir bin
<span style="color: #87ceeb;">cd</span> bin
git clone git://git.code.sf.net/p/plplot/plplot plplot.git
</pre>
</div>
<ul class="org-ul">
<li>This will download the source code and put it into a folder. Ours will be called PLplotSrc, you may rename yours to this if you wish</li>
<li>Before continuing we will need to add some path variables in our ~/.bashrc, open ~/.bashrc and write the following. This will tell PLplot to use the ifort compiler (This should be the path to the ifort compiler i.e. where ever you installed it)</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #87ceeb;">export</span> <span style="color: #ffc125;">FC</span>=/opt/intel/bin/ifort
</pre>
</div>
<ul class="org-ul">
<li>Back inside our ~/bin folder with our PLplotSrc sub directory, make the following directories</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">mkdir buildDir
mkdir installDir
<span style="color: #87ceeb;">cd</span> buildDir
</pre>
</div>
<ul class="org-ul">
<li>Just in case, copy the file CMakeLists.txt into your buildDir directory which should be located in PLplotSrc</li>
<li>We are now going to run the CMAKE command which has the following syntax</li>
<li><b>MAKE SURE</b> you run this command whilst in the buildDir and <b>NOT</b> PLplotSrc or installDir</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">cmake -DCMAKE_INSTALL_PREFIX=/path/to/installDir /path/to/PLplotSrc
</pre>
</div>
<ul class="org-ul">
<li>After the command finishes run the following</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">make 
sudo make install
</pre>
</div>
<ul class="org-ul">
<li>This should take a bit but whens its done you&rsquo;re almost finished!</li>
<li>This should have filled your installDir with lovely source code. Now simply add the following to your ~/.bashrc (Double check the final files names as they may change with versions of PLplot</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #87ceeb;">export</span> <span style="color: #ffc125;">PKG_CONFIG_PATH</span>=$<span style="color: #ffc125;">PKG_CONFIG_PATH</span>:~/bin/installDir/lib/pkgconfig/
<span style="color: #87ceeb;">export</span> <span style="color: #ffc125;">LD_LIBRARY_PATH</span>=$<span style="color: #ffc125;">LD_LIBRARY_PATH</span>:~/bin/installDir/lib/
<span style="color: #87ceeb;">export</span> <span style="color: #ffc125;">LD_LIBRARY_PATH</span>=$<span style="color: #ffc125;">LD_LIBRARY_PATH</span>:~/bin/buildDir/bindings/fortran/
</pre>
</div>
<ul class="org-ul">
<li>Open and close the terminal, that should be everything</li>
</ul>
</div>
</div>
