README.org
** NumFort
- Download and move numFort repository files to specified location eg. /path/to/numFort
- Your final makefile should look something like this
#+BEGIN_SRC shell
  # Fortran base MakeFile
# Directory to numFort
DIR = /path/to/numFort

F90C = ifort
F90FLAGS = -O2
CFLAGS = -O2 -xHost -mkl

PLPLOT = $$(pkg-config --cflags --libs plplot-fortran)
LIBS = -lmkl_lapack95_lp64 -lplplotfortran -lplplot 
MYLIBS = -I$(DIR)

%.o: %.f90
	$(F90C) $(CFLAGS) -c $<

# Library object files
LIBOBJS = $(DIR)lapack.o\
	$(DIR)numFort.o

# Own personal object files
OBJS = 

all: filename

filename: filename.f90 
	$(F90C) $(CFLAGS) -o $@ $< $(OBJS) $(LIBOBJS) $(LIBS) $(PLPLOT) $(MYLIBS)

clean:
	rm *.o *.mod
#+END_SRC
- *SOME IMPORTANT NOTES ON THE ABOVE MAKEFILE*

- for the PLPLOT variable, plplot-fortran is the name of the pkg-config FORTRAN file located in installDir/lib/pkgconfig. It may have a different name for you (In this case for us it is called plplot-fortran.pc)

- DIR is the directory where you have put all the numFort source code

- The bash file /recompile.sh/ in the repository can be used to recompile these libraries if you should choose to edit and add. Simply run with ./recompile.sh whilst in the directory. Alternatively one may run the following command in the terminal

#+BEGIN_SRC shell
  (cd /path/to/numFort/; ./recompile.sh)
#+END_SRC

- Include your own module files under the variable *OBJS*. Bonza, you should be ready to go

* Documentation
The two modules you may include are /kinds/ and /numFort/. Simply include in any .f90 file via a simple use statement as per usual. 
#+BEGIN_SRC fortran
  program progName
        use kinds
        use numFort

        ...

  end progName
#+END_SRC
Below we will give short descriptions of the module files and the subroutines and functions contained inside.

Make sure to search for these functions inside numFort to see their parameters. A brief description of their parameters are listed below for _ALL_ possible routine variants.

** Kinds
Precision parameter file. Main uses are for constants like pi and making variables double precision.

** NumFort

*** Factorial
Calculates the factorial of n

|-----------+---------------------|
| Variable  | Description         |
|-----------+---------------------|
| n         | integer             |
|-----------+---------------------|
| factorial | outputted factorial |
|-----------+---------------------|

*** Meshgrid
Creates a unique lattice of points for two given vectors x and y. Usually used for making a 3D grid for 3 dimensional plots.

|----------+---------------------------------------|
| Variable | Description                           |
|----------+---------------------------------------|
| x        | double precision vector               |
| y        | double precision vector               |
|----------+---------------------------------------|
| XX       | matrix of dimension (size(y),size(x)) |
| YY       | matrix of dimension (size(y),size(x)) |
|----------+---------------------------------------|


*** Splinefit
Fits a cubic spline to inputted data. This function can return the coefficients or just a list of desired points to be interpolated at.

|----------+------------------------------------------|
| Variable | Description                              |
|----------+------------------------------------------|
| x        | double precision vector                  |
| y        | double precision vector                  |
| xj       | this is the vector x for calculation use |
| intpts   | points to interpolate at (vector)        |
|----------+------------------------------------------|
| intvals  | outputted interpolant values             |
| c        | coefficients for spline fit              |
|----------+------------------------------------------|

*** PolyFit
Exactly the same as SplineFit but for a Nth order polynomial.

|----------+----------------------------------|
| Variable | Description                      |
|----------+----------------------------------|
| N        | integer, order of polynomial     |
| x        | double precision vector          |
| y        | double precision vector          |
|----------+----------------------------------|
| c        | coefficient of fit               |
| x        | value to calculate polynomial at |
|----------+----------------------------------|

