README.html

<div id="outline-container-org6b42087" class="outline-3">
<h3 id="org6b42087"><span class="section-number-3">2.4</span> NumFort</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Download and move numFort repository files to specified location eg. /path/to/numFort</li>
<li>Your final makefile should look something like this</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">  <span style="color: #75715E;"># </span><span style="color: #999999; font-style: italic;">Fortran base MakeFile</span>
<span style="color: #75715E;"># </span><span style="color: #999999; font-style: italic;">Directory to numFort</span>
DIR = /path/to/numFort

F90C = ifort
F90FLAGS = -O2
CFLAGS = -O2 -xHost -mkl

PLPLOT = $<span style="color: #ffc125;">$</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF; font-weight: bold;">pkg-config</span> --cflags --libs plplot-fortran<span style="color: #AE81FF;">)</span>
LIBS = -lmkl_lapack95_lp64 -lplplotfortran -lplplot 
MYLIBS = -I$<span style="color: #AE81FF;">(</span><span style="color: #AE81FF; font-weight: bold;">DIR</span><span style="color: #AE81FF;">)</span>

%.o: %.f90
        $<span style="color: #AE81FF;">(</span><span style="color: #AE81FF; font-weight: bold;">F90C</span><span style="color: #AE81FF;">)</span> $<span style="color: #AE81FF;">(</span><span style="color: #AE81FF; font-weight: bold;">CFLAGS</span><span style="color: #AE81FF;">)</span> -c $&lt;

<span style="color: #75715E;"># </span><span style="color: #999999; font-style: italic;">Library object files</span>
LIBOBJS = $<span style="color: #AE81FF;">(</span><span style="color: #AE81FF; font-weight: bold;">DIR</span><span style="color: #AE81FF;">)</span>lapack.o<span style="color: #E6DB74; font-weight: bold;">\</span>
        $<span style="color: #AE81FF;">(</span><span style="color: #AE81FF; font-weight: bold;">DIR</span><span style="color: #AE81FF;">)</span>numFort.o

<span style="color: #75715E;"># </span><span style="color: #999999; font-style: italic;">Own personal object files</span>
OBJS = 

all: filename

filename: filename.f90 
        $<span style="color: #AE81FF;">(</span><span style="color: #AE81FF; font-weight: bold;">F90C</span><span style="color: #AE81FF;">)</span> $<span style="color: #AE81FF;">(</span><span style="color: #AE81FF; font-weight: bold;">CFLAGS</span><span style="color: #AE81FF;">)</span> -o $<span style="color: #ffc125;">@</span> $&lt; $<span style="color: #AE81FF;">(</span><span style="color: #AE81FF; font-weight: bold;">OBJS</span><span style="color: #AE81FF;">)</span> $<span style="color: #AE81FF;">(</span><span style="color: #AE81FF; font-weight: bold;">LIBOBJS</span><span style="color: #AE81FF;">)</span> $<span style="color: #AE81FF;">(</span><span style="color: #AE81FF; font-weight: bold;">LIBS</span><span style="color: #AE81FF;">)</span> $<span style="color: #AE81FF;">(</span><span style="color: #AE81FF; font-weight: bold;">PLPLOT</span><span style="color: #AE81FF;">)</span> $<span style="color: #AE81FF;">(</span><span style="color: #AE81FF; font-weight: bold;">MYLIBS</span><span style="color: #AE81FF;">)</span>

clean:
        rm *.o *.mod
</pre>
</div>
<ul class="org-ul">
<li><b>SOME IMPORTANT NOTES ON THE ABOVE MAKEFILE</b></li>

<li>for the PLPLOT variable, plplot-fortran is the name of the pkg-config FORTRAN file located in installDir/lib/pkgconfig. It may have a different name for you (In this case for us it is called plplot-fortran.pc)</li>

<li>DIR is the directory where you have put all the numFort source code</li>

<li>The bash file <i>recompile.sh</i> in the repository can be used to recompile these libraries if you should choose to edit and add. Simply run with ./recompile.sh whilst in the directory. Alternatively one may run the following command in the terminal</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #AE81FF;">(</span><span style="color: #87ceeb;">cd</span> /home/username/bin; ./recompile.sh<span style="color: #AE81FF;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>Include your own module files under the variable <b>OBJS</b>. Bonza, you should be ready to go</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org97c72eb" class="outline-2">
<h2 id="org97c72eb"><span class="section-number-2">3</span> Documentation</h2>
<div class="outline-text-2" id="text-3">
<p>
The two modules you may include are <i>kinds</i> and <i>numFort</i>. Simply include in any .f90 file via a simple use statement as per usual. 
</p>
<div class="org-src-container">
<pre class="src src-fortran"><span style="color: #00ffff; font-weight: bold;">program</span> <span style="color: #00ff7f;">progName</span>
      use kinds
      use numFort

      ...

<span style="color: #00ffff; font-weight: bold;">end</span> progName
</pre>
</div>
<p>
Below we will give short descriptions of the module files and the subroutines and functions contained inside.
</p>

<p>
Make sure to search for these functions inside numFort to see their parameters. A brief description of their parameters are listed below for <span class="underline">ALL</span> possible routine variants.
</p>
</div>

<div id="outline-container-orgdb119c0" class="outline-3">
<h3 id="orgdb119c0"><span class="section-number-3">3.1</span> Kinds</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Precision parameter file. Main uses are for constants like pi and making variables double precision.
</p>
</div>
</div>

<div id="outline-container-org55540e7" class="outline-3">
<h3 id="org55540e7"><span class="section-number-3">3.2</span> NumFort</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org4f359b2" class="outline-4">
<h4 id="org4f359b2"><span class="section-number-4">3.2.1</span> Factorial</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Calculates the factorial of n
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">n</td>
<td class="org-left">integer</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">factorial</td>
<td class="org-left">outputted factorial</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgb15ff21" class="outline-4">
<h4 id="orgb15ff21"><span class="section-number-4">3.2.2</span> Meshgrid</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Creates a unique lattice of points for two given vectors x and y. Usually used for making a 3D grid for 3 dimensional plots.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">x</td>
<td class="org-left">double precision vector</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">double precision vector</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">XX</td>
<td class="org-left">matrix of dimension (size(y),size(x))</td>
</tr>

<tr>
<td class="org-left">YY</td>
<td class="org-left">matrix of dimension (size(y),size(x))</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org96b0d9f" class="outline-4">
<h4 id="org96b0d9f"><span class="section-number-4">3.2.3</span> Splinefit</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
Fits a cubic spline to inputted data. This function can return the coefficients or just a list of desired points to be interpolated at.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">x</td>
<td class="org-left">double precision vector</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">double precision vector</td>
</tr>

<tr>
<td class="org-left">xj</td>
<td class="org-left">this is the vector x for calculation use</td>
</tr>

<tr>
<td class="org-left">intpts</td>
<td class="org-left">points to interpolate at (vector)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">intvals</td>
<td class="org-left">outputted interpolant values</td>
</tr>

<tr>
<td class="org-left">c</td>
<td class="org-left">coefficients for spline fit</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3ef7f96" class="outline-4">
<h4 id="org3ef7f96"><span class="section-number-4">3.2.4</span> PolyFit</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
Exactly the same as SplineFit but for a Nth order polynomial.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">N</td>
<td class="org-left">integer, order of polynomial</td>
</tr>

<tr>
<td class="org-left">x</td>
<td class="org-left">double precision vector</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">double precision vector</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">c</td>
<td class="org-left">coefficient of fit</td>
</tr>

<tr>
<td class="org-left">x</td>
<td class="org-left">value to calculate polynomial at</td>
</tr>
</tbody>
</table>
</div>
</div>
