README.org
*** rk4
Performs a 4th order Runge Kutta solving algorithm for a given DE. Algorithms giving for a single DE or 2 coupled DE. May have this method go over a range of points or just a single step.

|----------+----------------------------------------|
| Variable | Description                            |
|----------+----------------------------------------|
| t0       | initial value to start stepping at     |
| tN       | final value to step to                 |
| y0       | initial y value                        |
| N        | total number of points to step through |
| f        | input function                         |
| h        | step size                              |
|----------+----------------------------------------|
| x        | value to calculate polynomial at       |
| t        | outputted x values                     |
| y        | outputted y values                     |
|----------+----------------------------------------|

*** GuessZero
Given a set of values or a function with boundaries, returns the approximate value of where the function changes sign. An index is returned for inputted values method and the x value exactly is returned for the function method.

|-----------+---------------------------------|
| Variable  | Description                     |
|-----------+---------------------------------|
| f         | input function                  |
| fvals     | list of y values for a function |
| a,b       | range for zero guess            |
|-----------+---------------------------------|
| GuessZero | integer index of zero location  |
|-----------+---------------------------------|

*** Newton1D
Performs a 1 dimensional newtons method to find the zero of a function.

|----------+---------------------------------------|
| Variable | Description                           |
|----------+---------------------------------------|
| fn       | Input function                        |
| guess    | initial guess of zero of the function |
|----------+---------------------------------------|
| newton1D | zero of function guess location       |
|----------+---------------------------------------|

*** Linspace
Creates a linear space of points between a and b with N points.

|----------+----------------------------------|
| Variable | Description                      |
|----------+----------------------------------|
| start    | left bound                       |
| finish   | right bound                      |
| N        | number of points, integer        |
|----------+----------------------------------|
| linspace | vector of points between a and b |
|----------+----------------------------------|

*** Deriv
Numerically calculates the derivative via a centred finite difference method.

|----------+-------------------------------|
| Variable | Description                   |
|----------+-------------------------------|
| f        | Input function                |
| x0       | value to calculate            |
|----------+-------------------------------|
| deriv    | value of numerical derivative |
|----------+-------------------------------|

*** integral
Numerically calculates an integral given a function and bounds. Using Gaussin quadrature.

|----------+-----------------------------|
| Variable | Description                 |
|----------+-----------------------------|
| f        | Input function              |
| a        | left bound                  |
| b        | right bound                 |
| absErr   | absolute error              |
| relErr   | relative error              |
|----------+-----------------------------|
| integral | numerical value of integral |
|----------+-----------------------------|

** PLplot

Call PLplot by using the subroutine plot() for example, this will call various wrappers to plplot which can be found within numFort. Below is a list of said wrappers and their arguments. Axes labels and title may be omitted in all below routines if one wishes.

*** plot
Can be called in the two following ways
#+BEGIN_SRC fortran
  real(DP),dimension(N,M) :: data ! x values in columns 1,3,.. y values in 2,4,...
  real(DP),dimension(N)   :: x,y
  character(len=*)        :: xlabel,ylabel,title

  call plot(x,y,xlabel,ylabel,title)
  call plot(data,xlabel,ylabel,title)
#+END_SRC
produces a standard x vs y plot. 

*** scatterplot
Can be called in the two following ways
#+BEGIN_SRC fortran
  real(DP),dimension(N)   :: x,y
  character(len=*)        :: xlabel,ylabel,title,style ! style = "+" for example

  call scatterplot(x,y,style,xaxis,yaxis,title)
#+END_SRC
produces a standard scatter plot of x vs y.

