README.html

<div id="outline-container-orgb507e27" class="outline-4">
<h4 id="orgb507e27"><span class="section-number-4">3.2.5</span> rk4</h4>
<div class="outline-text-4" id="text-3-2-5">
<p>
Performs a 4th order Runge Kutta solving algorithm for a given DE. Algorithms giving for a single DE or 2 coupled DE. May have this method go over a range of points or just a single step.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">t0</td>
<td class="org-left">initial value to start stepping at</td>
</tr>

<tr>
<td class="org-left">tN</td>
<td class="org-left">final value to step to</td>
</tr>

<tr>
<td class="org-left">y0</td>
<td class="org-left">initial y value</td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left">total number of points to step through</td>
</tr>

<tr>
<td class="org-left">f</td>
<td class="org-left">input function</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">step size</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">x</td>
<td class="org-left">value to calculate polynomial at</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">outputted x values</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">outputted y values</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org87aba27" class="outline-4">
<h4 id="org87aba27"><span class="section-number-4">3.2.6</span> GuessZero</h4>
<div class="outline-text-4" id="text-3-2-6">
<p>
Given a set of values or a function with boundaries, returns the approximate value of where the function changes sign. An index is returned for inputted values method and the x value exactly is returned for the function method.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">f</td>
<td class="org-left">input function</td>
</tr>

<tr>
<td class="org-left">fvals</td>
<td class="org-left">list of y values for a function</td>
</tr>

<tr>
<td class="org-left">a,b</td>
<td class="org-left">range for zero guess</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">GuessZero</td>
<td class="org-left">integer index of zero location</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf025a38" class="outline-4">
<h4 id="orgf025a38"><span class="section-number-4">3.2.7</span> Newton1D</h4>
<div class="outline-text-4" id="text-3-2-7">
<p>
Performs a 1 dimensional newtons method to find the zero of a function.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">fn</td>
<td class="org-left">Input function</td>
</tr>

<tr>
<td class="org-left">guess</td>
<td class="org-left">initial guess of zero of the function</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">newton1D</td>
<td class="org-left">zero of function guess location</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org6326a36" class="outline-4">
<h4 id="org6326a36"><span class="section-number-4">3.2.8</span> Linspace</h4>
<div class="outline-text-4" id="text-3-2-8">
<p>
Creates a linear space of points between a and b with N points.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">start</td>
<td class="org-left">left bound</td>
</tr>

<tr>
<td class="org-left">finish</td>
<td class="org-left">right bound</td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left">number of points, integer</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">linspace</td>
<td class="org-left">vector of points between a and b</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgccf858f" class="outline-4">
<h4 id="orgccf858f"><span class="section-number-4">3.2.9</span> Deriv</h4>
<div class="outline-text-4" id="text-3-2-9">
<p>
Numerically calculates the derivative via a centred finite difference method.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">f</td>
<td class="org-left">Input function</td>
</tr>

<tr>
<td class="org-left">x0</td>
<td class="org-left">value to calculate</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">deriv</td>
<td class="org-left">value of numerical derivative</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org01ade21" class="outline-4">
<h4 id="org01ade21"><span class="section-number-4">3.2.10</span> integral</h4>
<div class="outline-text-4" id="text-3-2-10">
<p>
Numerically calculates an integral given a function and bounds. Using Gaussin quadrature.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">f</td>
<td class="org-left">Input function</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-left">left bound</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-left">right bound</td>
</tr>

<tr>
<td class="org-left">absErr</td>
<td class="org-left">absolute error</td>
</tr>

<tr>
<td class="org-left">relErr</td>
<td class="org-left">relative error</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">integral</td>
<td class="org-left">numerical value of integral</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgf4e99d2" class="outline-3">
<h3 id="orgf4e99d2"><span class="section-number-3">3.3</span> PLplot</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Call PLplot by using the subroutine plot() for example, this will call various wrappers to plplot which can be found within numFort. Below is a list of said wrappers and their arguments. Axes labels and title may be omitted in all below routines if one wishes.
</p>
</div>

<div id="outline-container-orga66e583" class="outline-4">
<h4 id="orga66e583"><span class="section-number-4">3.3.1</span> plot</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Can be called in the two following ways
</p>
<div class="org-src-container">
<pre class="src src-fortran"><span style="color: #00cd00;">real</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">DP</span><span style="color: #AE81FF;">)</span>,<span style="color: #00cd00;">dimension</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">N</span>,<span style="color: #ffc125;">M</span><span style="color: #AE81FF;">)</span> :: <span style="color: #00cd00;">data</span> <span style="color: #75715E;">! </span><span style="color: #999999; font-style: italic;">x values in columns 1,3,.. y values in 2,4,...</span>
<span style="color: #00cd00;">real</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">DP</span><span style="color: #AE81FF;">)</span>,<span style="color: #00cd00;">dimension</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">N</span><span style="color: #AE81FF;">)</span>   :: x,y
<span style="color: #75715E;">c</span><span style="color: #999999; font-style: italic;">haracter(len=*)        :: xlabel,ylabel,title</span>

<span style="color: #75715E;">c</span><span style="color: #999999; font-style: italic;">all plot(x,y,xlabel,ylabel,title)</span>
<span style="color: #75715E;">c</span><span style="color: #999999; font-style: italic;">all plot(data,xlabel,ylabel,title)</span>
</pre>
</div>
<p>
produces a standard x vs y plot. 
</p>
</div>
</div>

<div id="outline-container-org1d29dfb" class="outline-4">
<h4 id="org1d29dfb"><span class="section-number-4">3.3.2</span> scatterplot</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
Can be called in the two following ways
</p>
<div class="org-src-container">
<pre class="src src-fortran"><span style="color: #00cd00;">real</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">DP</span><span style="color: #AE81FF;">)</span>,<span style="color: #00cd00;">dimension</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">N</span><span style="color: #AE81FF;">)</span>   :: x,y
<span style="color: #75715E;">c</span><span style="color: #999999; font-style: italic;">haracter(len=*)        :: xlabel,ylabel,title,style ! style = "+" for example</span>

<span style="color: #75715E;">c</span><span style="color: #999999; font-style: italic;">all scatterplot(x,y,style,xaxis,yaxis,title)</span>
</pre>
</div>
<p>
produces a standard scatter plot of x vs y.
</p>
</div>
</div>
