README.org
*** surf
Can be called in the two following ways
#+BEGIN_SRC fortran
  real(DP),dimension(N)   :: X
  real(DP),dimension(M)   :: Y
  real(DP),dimension(M,N) :: Z
  character(len=*)        :: xlabel,ylabel,zlabel,title

  ! usually create the grids for Z using "call meshgrid(x,y,XX,YY)"
  ! XX = MxN and YY = MxN

  call surf(X,Y,Z,xlabel,ylabel,zlabel,title)
#+END_SRC


*** scatter3D
Can be called in the two following ways
#+BEGIN_SRC fortran
  real(DP),dimension(N)   :: x,y,z
  character(len=*)        :: xlabel,ylabel,zlabel,title

 call scatter3D(X,Y,Z,xlabel,ylabel,zlabel,title)
#+END_SRC
