README.html

<div id="outline-container-org947f68d" class="outline-4">
<h4 id="org947f68d"><span class="section-number-4">3.3.3</span> surf</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
Can be called in the two following ways
</p>
<div class="org-src-container">
<pre class="src src-fortran"><span style="color: #00cd00;">real</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">DP</span><span style="color: #AE81FF;">)</span>,<span style="color: #00cd00;">dimension</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">N</span><span style="color: #AE81FF;">)</span>   :: X
<span style="color: #00cd00;">real</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">DP</span><span style="color: #AE81FF;">)</span>,<span style="color: #00cd00;">dimension</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">M</span><span style="color: #AE81FF;">)</span>   :: Y
<span style="color: #00cd00;">real</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">DP</span><span style="color: #AE81FF;">)</span>,<span style="color: #00cd00;">dimension</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">M</span>,<span style="color: #ffc125;">N</span><span style="color: #AE81FF;">)</span> :: Z
<span style="color: #75715E;">c</span><span style="color: #999999; font-style: italic;">haracter(len=*)        :: xlabel,ylabel,zlabel,title</span>

<span style="color: #75715E;">! </span><span style="color: #999999; font-style: italic;">usually create the grids for Z using "call meshgrid(x,y,XX,YY)"</span>
<span style="color: #75715E;">! </span><span style="color: #999999; font-style: italic;">XX = MxN and YY = MxN</span>

<span style="color: #75715E;">c</span><span style="color: #999999; font-style: italic;">all surf(X,Y,Z,xlabel,ylabel,zlabel,title)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org43d4a2b" class="outline-4">
<h4 id="org43d4a2b"><span class="section-number-4">3.3.4</span> scatter3D</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
Can be called in the two following ways
</p>
<div class="org-src-container">
<pre class="src src-fortran"> <span style="color: #00cd00;">real</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">DP</span><span style="color: #AE81FF;">)</span>,<span style="color: #00cd00;">dimension</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">N</span><span style="color: #AE81FF;">)</span>   :: x,y,z
 <span style="color: #00cd00;">character</span><span style="color: #AE81FF;">(</span><span style="color: #ffc125;">len</span>=*<span style="color: #AE81FF;">)</span>        :: xlabel,ylabel,zlabel,title

<span style="color: #75715E;">c</span><span style="color: #999999; font-style: italic;">all scatter3D(X,Y,Z,xlabel,ylabel,zlabel,title)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Anthony Kalaitzis</p>
<p class="date">Created: 2018-08-13 Mon 00:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
